"AU Direct Debit" = "AU Direct Debit";

"Affirm" = "Affirm";

"Afterpay" = "Afterpay";

"Alipay" = "Alipay";

"BLIK" = "BLIK";

"Bacs Direct Debit" = "Bacs Direct Debit";

"Bancontact" = "Bancontact";

"Boleto" = "Boleto";

"Card" = "Kort";

"Cash App Pay" = "Cash App Pay";

"Clearpay" = "Clearpay";

"EPS" = "EPS";

"FPX" = "FPX";

"GrabPay" = "GrabPay";

"Klarna" = "Klarna";

"Konbini" = "Konbini";

"Link" = "Link";

"NetBanking" = "Onlinebanking";

"OXXO" = "OXXO";

"PayPal" = "PayPal";

"Przelewy24" = "Przelewy24";

"SEPA Debit" = "SEPA Debit";

"Sofort" = "Sofort";

"Swish" = "Swish";

"Timed out authenticating your payment method -- try again" = "Bekræftelsen af din betalingsmetode udløb -- prøv igen.";

"UPI" = "UPI";

"US bank account" = "Bankkonto i USA";

"Unknown" = "Ukendt";

"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Vi kunne ikke bekræfte din betalingsmetode. Vælg venligst en anden betalingsmetode, og prøv igen.";

"WeChat Pay" = "WeChat Pay";

"giropay" = "giropay";

"iDEAL" = "iDEAL";
